Public Member Functions | List of all members
ACAPI::ModelCheckResult Class Reference
Model Quality Check Management
The type of the check result returned by the AddOn. More...
#include <ModelCheckMethodCallback.hpp>
 Public Member Functions
ModelCheckResult (const API_Guid &)
Creates a ModelCheckResult from a single element.
ModelCheckResult (const API_Guid &, const API_Guid &)
Creates a ModelCheckResult from two elements.
const API_Guid &  | GetFirstElement () const
const API_Guid &  | GetSecondElement () const
Detailed Description
The type of the check result returned by the AddOn.
Since
Archicad 29
Example
class AttributeManagerImportTestCallback : public ACAPI::AttributeManagerImportCallback {
public:
 AttributeManagerImportTestCallback ()
 : ACAPI::AttributeManagerImportCallback ("txt")
 {}
 ~AttributeManagerImportTestCallback ()
 {}
 GSErrCode ImportAttributeProcess (const IO::Location& /*sourceFile*/, GS::Array<GS::Pair<API_Attribute, API_AttributeDefExt*>>& /*result*/) const override
 {
 return NoError;
 }
 API_AttributeManagerFormat GetFileTypeFormat () const override
 {
 return { 'TEXT', 'GSAC', "Test txt file", "txt" };
 }
};
// AttributeManagerImportTestCallback instance;
Member Function Documentation
◆ GetFirstElement()
 const API_Guid & ACAPI::ModelCheckResult::GetFirstElement  |  ( |   | ) |   const
Returns
Returns the first element from the ModelCheckResult.
◆ GetSecondElement()
 const API_Guid & ACAPI::ModelCheckResult::GetSecondElement  |  ( |   | ) |   const
Returns
Returns the second element from the ModelCheckResult.